In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=["a","b","c"]
index=[1,2,3]

In [10]:
ser=pd.Series(labels,index)
ser

1    a
2    b
3    c
dtype: object

In [11]:
dataf=pd.DataFrame(np.random.randn(4,4),["a","b","c","d"],["x","y","z","q"])

In [8]:
dataf

          x         y         z         q
a -0.159451 -1.403597 -0.485626 -0.430102
b -0.205239 -2.111242 -1.185534 -0.097149
c -1.017372  1.711918  1.769123 -0.540688
d -3.725995  0.324916 -1.545776  0.323031

In [59]:
booldataf=dataf['q']>0

In [60]:
booldataf

a    False
b     True
c     True
d    False
Name: q, dtype: bool

In [61]:
dataf[booldataf]

          x         y         z         q
b  0.276472  0.476857 -2.243362  1.009578
c -0.128727  1.025906  0.526990  1.030480

In [64]:
dataf[booldataf][["x","y"]]

          x         y
b  0.276472  0.476857
c -0.128727  1.025906

In [65]:
mycol=["x","y"]
booldata=dataf["q"]>0
result=dataf[booldata][mycol]

In [66]:
result

          x         y
b  0.276472  0.476857
c -0.128727  1.025906

In [72]:
dataf[(dataf["q"]>0) | (dataf["y"]>1)]

          x         y         z         q
a -0.658074  1.323801  0.173406 -1.021057
b  0.276472  0.476857 -2.243362  1.009578
c -0.128727  1.025906  0.526990  1.030480

In [71]:
dataf[booldata]

ValueError: Item wrong length 1 instead of 4.

In [93]:
dataf.set_index([newin],inplace=True)

In [94]:
dataf

          x         y         z         q
n -0.658074  1.323801  0.173406 -1.021057
i  0.276472  0.476857 -2.243362  1.009578
s -0.128727  1.025906  0.526990  1.030480
h -1.039285  0.689693 -0.871743 -1.229628

In [88]:
newin=newind.split()

In [89]:
newin

['n', 'i', 's', 'h']

In [34]:
dataf[["x","y"]]

     x    y
a  1.0  1.0
b  1.0  1.0
c  1.0  1.0
d  1.0  1.0

In [48]:
dataf['new']=dataf["x"]+dataf["y"]
dataf['new']

a    2.0
b    2.0
c    2.0
d    2.0
Name: new, dtype: float64

In [49]:
dataf.drop('new',1,inplace=True)

In [51]:
dataf>0

      x     y     z     q
a  True  True  True  True
b  True  True  True  True
c  True  True  True  True
d  True  True  True  True

In [54]:
booldataf=dataf>=1

In [55]:
dataf[booldataf]

     x    y    z    q
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0
c  1.0  1.0  1.0  1.0
d  1.0  1.0  1.0  1.0

In [50]:
dataf

     x    y    z    q
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0
c  1.0  1.0  1.0  1.0
d  1.0  1.0  1.0  1.0

In [38]:
dataf.loc['a']

x      1.0
y      1.0
z      1.0
q      1.0
new    2.0
Name: a, dtype: float64

In [41]:
dataf.iloc[2]

x    1.0
y    1.0
z    1.0
q    1.0
Name: c, dtype: float64

In [45]:
dataf.loc[["a","b"],["x","y"]]

     x    y
a  1.0  1.0
b  1.0  1.0

In [98]:
outside=['g1','g1','g1','g2','g2','g2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [100]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,['a','b'])

In [101]:
df

             a         b
g1 1 -0.358546 -0.295898
   2  1.993112 -0.112407
   3  1.784457 -0.472037
g2 1 -0.267279  0.833644
   2 -1.282674 -1.209810
   3 -0.245900  0.289637

In [103]:
df.index.names=['Groups','Num']
df

                   a         b
Groups Num
g1     1   -0.358546 -0.295898
       2    1.993112 -0.112407
       3    1.784457 -0.472037
g2     1   -0.267279  0.833644
       2   -1.282674 -1.209810
       3   -0.245900  0.289637

In [105]:
df.loc['g1',2]['a']

1.9931123087080125

In [106]:
df.loc['g2'].loc[2]['b']

-1.2098101620256898

In [107]:
df.loc['g2'].loc[1]['a']

-0.26727899893104096

In [22]:
dataf

          x         y         z         q
a -1.948842  0.238485  0.624158  1.100887
b -0.846399 -0.034091 -1.735229  1.641094
c -0.575263 -0.179488 -0.083816 -1.011373
d -0.145934 -2.523339  1.261522 -0.875515
e -0.231177  1.144997 -0.877143 -0.704826

In [109]:
df

                   a         b
Groups Num
g1     1   -0.358546 -0.295898
       2    1.993112 -0.112407
       3    1.784457 -0.472037
g2     1   -0.267279  0.833644
       2   -1.282674 -1.209810
       3   -0.245900  0.289637

In [110]:
df.xs('g1')

            a         b
Num
1   -0.358546 -0.295898
2    1.993112 -0.112407
3    1.784457 -0.472037

In [112]:
df.xs(1,level='Num')

               a         b
Groups
g1     -0.358546 -0.295898
g2     -0.267279  0.833644

In [113]:
df.loc['g1'].loc[1]['a']

-0.3585462853609795

In [125]:
d={'a':[1,2,3,np.nan],'b':[5,np.nan,np.nan,np.nan],'c':[1,2,3,4]}

In [126]:
d

{'a': [1, 2, 3, nan], 'b': [5, nan, nan, nan], 'c': [1, 2, 3, 4]}

In [133]:
df=pd.DataFrame(d)

In [135]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  3.0  NaN  3
3  NaN  NaN  4

In [139]:
df.dropna(thresh=2,axis=1)

     a  c
0  1.0  1
1  2.0  2
2  3.0  3
3  NaN  4

In [141]:
df.fillna('fillvalue')

           a          b  c
0          1          5  1
1          2  fillvalue  2
2          3  fillvalue  3
3  fillvalue  fillvalue  4

In [142]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,['a','b'])

In [143]:
df

                   a         b
Groups Num
g1     1   -1.003288  0.450298
       2    0.455922 -0.962181
       3   -0.697407  0.671290
g2     1    1.172693 -0.193491
       2    2.296631  0.519702
       3   -0.417974 -0.031784